Classes | Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::PipeSegmentPreferenceTable Class Referencefinal
MEP Element Manager
The PipeSegmentPreferenceTable contains cross section related information for Pipe routing segments. More...
#include <MEPPipeSegmentPreferenceTable.hpp>
 Inheritance diagram for ACAPI::MEP::PipeSegmentPreferenceTable:
 Classes
class  | Modifier
Modifier of the PipeSegmentPreferenceTable. More...
 Public Member Functions
bool  | Exists () const
Result< void >  | IsEditable () const
Checks whether the table is editable.
GS::UniString  | GetName () const
uint32_t  | GetSize () const
Result< uint32_t >  | GetReferenceId (uint32_t index) const
Result< bool >  | IsRowValid (uint32_t index) const
A row is considered valid if its diameter and wall thickness contains non-zero values, description is optional.
Result< bool >  | IsRowValidByKey (uint32_t referenceId) const
A row is considered valid if its diameter and wall thickness contains non-zero values, description is optional.
Result< double >  | GetDiameter (uint32_t index) const
Result< double >  | GetDiameterByKey (uint32_t referenceId) const
Result< double >  | GetWallThickness (uint32_t index) const
Result< double >  | GetWallThicknessByKey (uint32_t referenceId) const
Result< GS::UniString >  | GetDescription (uint32_t index) const
Result< GS::UniString >  | GetDescriptionByKey (uint32_t referenceId) const
bool  | GetUseIndividualSegmentLengths () const
Returns whether the rigid segment segmentation is turned on. If this is false, there will be only one rigid segment for each routing segment, and the minimum and maximum segmentation lengths are ignored when generating routings.
double  | GetMinimumSegmentationLength () const
double  | GetMaximumSegmentationLength () const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< PipeSegmentPreferenceTable >  | Get (const UniqueID &uniqueId)
Returns a PipeSegmentPreferenceTable.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The PipeSegmentPreferenceTable contains cross section related information for Pipe routing segments.
Since
Archicad 28
The table uses the keys defined by the PipeReferenceSet. To consider a table row usable and valid, it should have all its fields filled, beside its description, which is optional.
Example code snippet from Test / New MEP
Getters
 for (const UniqueID& pipeSegmentTableId : pipeSegmentTableIds) {
 ACAPI::Result<PipeSegmentPreferenceTable> pipeSegmentTable = PipeSegmentPreferenceTable::Get (pipeSegmentTableId);
 if (pipeSegmentTable.IsErr ())
 continue;
 preferenceReporter.SetTabCount (2);
 preferenceReporter.Add ("Preference name", pipeSegmentTable->GetName ());
 preferenceReporter.Add ("Circular table:");
 for (uint32_t i = 0; i < pipeSegmentTable->GetSize (); ++i) {
 preferenceReporter.SetTabCount (3);
 preferenceReporter.Add ("ReferenceId", *pipeSegmentTable->GetReferenceId (i), false);
 preferenceReporter.SetTabCount (0);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Diameter", *pipeSegmentTable->GetDiameter (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("WallThickness", *pipeSegmentTable->GetWallThickness (i), false);
 preferenceReporter.Add (", ", false);
 GS::UniString description = *pipeSegmentTable->GetDescription (i);
 preferenceReporter.Add ("Description", description == GS::EmptyUniString ? "Empty" : description, false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add (*pipeSegmentTable->IsRowValid (i) ? "Row is valid" : "Row is not valid");
 }
 preferenceReporter.AddNewLine ();
 }
 Modification: take a look at DuctRectangularSegmentPreferenceTable
Member Function Documentation
◆ Exists()
 bool ACAPI::MEP::PipeSegmentPreferenceTable::Exists  |  ( |   | ) |   const
Returns
Checks if the object still exists.
◆ Get()
 static Result< PipeSegmentPreferenceTable > ACAPI::MEP::PipeSegmentPreferenceTable::Get  |  ( |  const UniqueID & |  uniqueId | )
static
Returns a PipeSegmentPreferenceTable.
Parameters
uniqueId | The UniqueID of the requested PipeSegmentPreferenceTable.
Returns
If the uniqueId belongs to a PipeSegmentPreferenceTable, returns the object associated to it, otherwise Error.
◆ GetDescription()
 Result< GS::UniString > ACAPI::MEP::PipeSegmentPreferenceTable::GetDescription  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the description of the table's row.
◆ GetDescriptionByKey()
 Result< GS::UniString > ACAPI::MEP::PipeSegmentPreferenceTable::GetDescriptionByKey  |  ( |  uint32_t |  referenceId | ) |   const
Parameters
referenceId | The referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
Returns
Returns error if the referenceId is not in the table, otherwise returns the description of the table's row.
◆ GetDiameter()
 Result< double > ACAPI::MEP::PipeSegmentPreferenceTable::GetDiameter  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetDiameterByKey()
 Result< double > ACAPI::MEP::PipeSegmentPreferenceTable::GetDiameterByKey  |  ( |  uint32_t |  referenceId | ) |   const
Parameters
referenceId | The referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
Returns
Returns error if the referenceId is not in the table, otherwise returns the diameter value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetMaximumSegmentationLength()
 double ACAPI::MEP::PipeSegmentPreferenceTable::GetMaximumSegmentationLength  |  ( |   | ) |   const
Returns
Returns the maximum segmentation length of the rigid segment. If the segmentation is turned off, the value is ignored when generating routings, and the rigid segment will be the same length as the routing segment.
◆ GetMinimumSegmentationLength()
 double ACAPI::MEP::PipeSegmentPreferenceTable::GetMinimumSegmentationLength  |  ( |   | ) |   const
Returns
Returns the minimum segmentation length of the rigid segment. If the segmentation is turned off, the value is ignored when generating routings, and the rigid segment will be the same length as the routing segment.
◆ GetName()
 GS::UniString ACAPI::MEP::PipeSegmentPreferenceTable::GetName  |  ( |   | ) |   const
Returns
Returns the name of the table.
◆ GetReferenceId()
 Result< uint32_t > ACAPI::MEP::PipeSegmentPreferenceTable::GetReferenceId  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the referenceId of the table's row.
◆ GetSize()
 uint32_t ACAPI::MEP::PipeSegmentPreferenceTable::GetSize  |  ( |   | ) |   const
Returns
Returns the size of the table.
◆ GetUseIndividualSegmentLengths()
 bool ACAPI::MEP::PipeSegmentPreferenceTable::GetUseIndividualSegmentLengths  |  ( |   | ) |   const
Returns whether the rigid segment segmentation is turned on. If this is false, there will be only one rigid segment for each routing segment, and the minimum and maximum segmentation lengths are ignored when generating routings.
Returns
Returns true if the rigid segment segmentation is turned on, and false if it's turned off.
◆ GetWallThickness()
 Result< double > ACAPI::MEP::PipeSegmentPreferenceTable::GetWallThickness  |  ( |  uint32_t |  index | ) |   const
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the wall thickness value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ GetWallThicknessByKey()
 Result< double > ACAPI::MEP::PipeSegmentPreferenceTable::GetWallThicknessByKey  |  ( |  uint32_t |  referenceId | ) |   const
Parameters
referenceId | The referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
Returns
Returns error if the referenceId is not in the table, otherwise returns the wall thickness value of the table's row. If the returned value is 0.0, the row is not valid yet.
◆ IsEditable()
 Result< void > ACAPI::MEP::PipeSegmentPreferenceTable::IsEditable  |  ( |   | ) |   const
Checks whether the table is editable.
Returns
Returns nothing if the table is editable, otherwise the error code and error message containing information about the reason.
◆ IsRowValid()
 Result< bool > ACAPI::MEP::PipeSegmentPreferenceTable::IsRowValid  |  ( |  uint32_t |  index | ) |   const
A row is considered valid if its diameter and wall thickness contains non-zero values, description is optional.
Parameters
index | The index of the row. Index starts from 0.
Returns
Returns error if the index is out of range, otherwise returns the validity state of the row.
◆ IsRowValidByKey()
 Result< bool > ACAPI::MEP::PipeSegmentPreferenceTable::IsRowValidByKey  |  ( |  uint32_t |  referenceId | ) |   const
A row is considered valid if its diameter and wall thickness contains non-zero values, description is optional.
Parameters
referenceId | The referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
Returns
Returns error if the referenceId is not in the PipeReferenceSet, otherwise returns the validity state of the row.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::PipeSegmentPreferenceTable::Modify  |  ( |  const ModifierFunc & |  modifierFunc,
|  const GS::UniString & |  undoString )
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.